In [1]:
import pandas as pd
import numpy as np 
import seaborn as sns

### Load Datasets and Exploratory Data Analysis

In [2]:
df_transaction = pd.read_csv('transaction_dat.csv')
df_account = pd.read_csv('account_dat.csv')
df_device = pd.read_csv('device_ref.csv')

df_inapp = pd.read_csv('in-app_dat.csv')
df_app = pd.read_csv('app_dat.csv')
df_category = pd.read_csv('category_ref.csv')

In [3]:
# account table

In [4]:
df_account.head()

            acct_id create_dt payment_type
0  eb23e449d274bddb    4/3/12         PMOF
1  3d60dcb8494a0d70   8/31/09         PMOF
2  9b6d6fbf76504d85   11/6/08         PMOF
3  343255370828b380    1/3/12         PMOF
4  664e27f05189c387  10/31/10         PMOF

In [5]:
df_account.describe()

                 acct_id create_dt payment_type
count             100000    100000       100000
unique            100000      3654            2
top     7482383f6c600cb0   5/25/13         PMOF
freq                   1        54        50000

In [6]:
df_account.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100000 entries, 0 to 99999
Data columns (total 3 columns):
 #   Column        Non-Null Count   Dtype
---  ------        --------------   -----
 0   acct_id       100000 non-null  object
 1   create_dt     100000 non-null  object
 2   payment_type  100000 non-null  object
dtypes: object(3)
memory usage: 2.3+ MB

In [7]:
min(df_account['create_dt'])

'1/1/08'

In [8]:
max(df_account['create_dt'])

'9/9/16'

In [9]:
df_account['payment_type'].value_counts()

PMOF         50000
Free only    50000
Name: payment_type, dtype: int64

In [10]:
len(df_account['acct_id'])

100000

In [11]:
df_account['acct_id'].nunique()

100000

In [12]:
# app table
df_app.head()

               app_name        content_id category_id  device_id
0  half-slouched having  22dfac9721b899cb         Y-8          3
1      lift whale-ships  7c645810cd7f166e         M-7          3
2    mightily community  c495bcb878faffaa         Y-8          2
3   session: too--shall  4e683dcd461cdd22         Y-8          1
4          That Zoology  6473dd29a2badbf1         Y-8          3

In [13]:
df_app.describe()

         device_id
count  1000.000000
mean      2.727000
std       0.612247
min       1.000000
25%       3.000000
50%       3.000000
75%       3.000000
max       3.000000

In [14]:
df_app[['app_name','content_id','category_id']].describe()

       app_name        content_id category_id
count      1000              1000        1000
unique      997              1000           5
top      #NAME?  dbfe06aef68805a7         Z-1
freq          4                 1         392

In [15]:
df_app['category_id'].value_counts()

Z-1    392
Y-8    260
M-7    153
Q-1    149
Q-5     46
Name: category_id, dtype: int64

In [16]:
# category table 
df_category

       category_name category_id
0              Games         Z-1
1  Social Networking         Q-5
2          Utilities         M-7
3      Entertainment         Q-1
4    Photos & Videos         Y-8

In [17]:
len(df_category)

5

In [18]:
# device table
df_device

  device_name  device_id
0      iPhone          1
1        iPad          2
2        Both          3

In [19]:
len(df_device)

3

In [20]:
# in app table
df_inapp.head()

  parent_app_content_id        content_id        type
0      d2bde35599e0dae9  227227a77c59809b  consumable
1      d2bde35599e0dae9  41ac2362a2600185  consumable
2      d2bde35599e0dae9  64a8e16f030bb611  consumable
3      d2bde35599e0dae9  2c8ba424183afa7c  consumable
4      d2bde35599e0dae9  b4c42fa5cc420f7b  consumable

In [21]:
df_inapp.describe()

       parent_app_content_id        content_id        type
count                   2376              2376        2376
unique                   476              2376           2
top         232fdcdc1b5f28fa  d628dfcf0bdfd98c  consumable
freq                      37                 1        2107

In [22]:
df_inapp['type'].value_counts()

consumable      2107
subscription     269
Name: type, dtype: int64

In [23]:
# transaction data 
df_transaction.head()

    create_dt        content_id           acct_id  price  device_id
0  2016-08-28  b6cf4f33e7455df4  220574a7a6a71afa  11.99          1
1  2016-09-16  71ac3e9c38ddbbba  8551f69a5015ea6a   1.99          2
2  2016-08-15  776b851b916c33d1  7dedf309494a1966   0.99          2
3  2016-06-17  7a47ca132a8dc695  7174a81c796dcf7e   1.99          2
4  2016-06-13  30581219bc952dbb  35aaf59d64a677e7  11.99          2

In [24]:
df_transaction.describe()

              price     device_id
count  3.607509e+06  3.607509e+06
mean   5.280511e+00  1.275302e+00
std    6.960452e+00  4.466662e-01
min    0.000000e+00  1.000000e+00
25%    0.000000e+00  1.000000e+00
50%    1.990000e+00  1.000000e+00
75%    7.990000e+00  2.000000e+00
max    2.999000e+01  2.000000e+00

In [25]:
df_transaction.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3607509 entries, 0 to 3607508
Data columns (total 5 columns):
 #   Column      Dtype
---  ------      -----
 0   create_dt   object
 1   content_id  object
 2   acct_id     object
 3   price       float64
 4   device_id   int64
dtypes: float64(1), int64(1), object(3)
memory usage: 137.6+ MB

In [26]:
pd.isna(df_transaction).sum()

create_dt     0
content_id    0
acct_id       0
price         0
device_id     0
dtype: int64

In [27]:
min(df_transaction['create_dt'])

'2016-06-01'

In [28]:
max(df_transaction['create_dt'])

'2016-09-21'

### Data Manipulation (join raw tables)

In [29]:
# change column name "create_dt" to "transaction_dt" in df_transaction
# to avoid same column name with df_account table 
df_transaction.columns = ['transaction_dt', 'content_id', 'acct_id', 'price', 'device_id']

In [30]:
# 25 account_id in df_transaction not exist in df_account
# In this analysis, these 25 account_id are removed 
len(set(df_transaction['acct_id']) - set(df_account['acct_id']))

25

In [31]:
# Join transaction and account 
df = pd.merge(df_transaction, df_account, on='acct_id', how='inner')

In [32]:
df.head()

,transaction_dt,content_id,acct_id,price,device_id,create_dt,payment_type
0,2016-08-28,b6cf4f33e7455df4,220574a7a6a71afa,11.99,1,8/29/09,PMOF
1,2016-07-19,4431e62862d98419,220574a7a6a71afa,23.99,1,8/29/09,PMOF
2,2016-08-08,14f26ecc7ab37e68,220574a7a6a71afa,0.99,1,8/29/09,PMOF
3,2016-08-20,bb314bdd29e3859b,220574a7a6a71afa,0.99,2,8/29/09,PMOF
4,2016-09-13,c3f2ef20181b73f6,220574a7a6a71afa,2.99,1,8/29/09,PMOF

In [33]:
df_transaction['device_id'].value_counts()

1    2614356
2     993153
Name: device_id, dtype: int64

In [34]:
df_device.head()

  device_name  device_id
0      iPhone          1
1        iPad          2
2        Both          3

In [35]:
# Join with df_device 
df = pd.merge(df, df_device, on='device_id', how='inner')

In [229]:
# There are 537 content_id in transaction table but not in in-app_dat.csv
len(set(df_transaction['content_id']) - set(df_inapp['content_id']))

537

In [37]:
# These content_id exists in app_dat.csv
# It means the transaction table includes both in-app purchases and app purchases 
df_app.loc[df_app['content_id'].isin(set(df_transaction['content_id']) - set(df_inapp['content_id'])),'content_id'].nunique()

537

In [38]:
# merge with df_inapp
df = pd.merge(df, df_inapp, on='content_id', how='left')

In [39]:
df.head()

,transaction_dt,content_id,acct_id,price,device_id,create_dt,payment_type,device_name,parent_app_content_id,type
0,2016-08-28,b6cf4f33e7455df4,220574a7a6a71afa,11.99,1,8/29/09,PMOF,iPhone,61cea77b9bc843d1,subscription
1,2016-07-19,4431e62862d98419,220574a7a6a71afa,23.99,1,8/29/09,PMOF,iPhone,62bbc9735ee184a4,consumable
2,2016-08-08,14f26ecc7ab37e68,220574a7a6a71afa,0.99,1,8/29/09,PMOF,iPhone,5070e02253fe2a85,consumable
3,2016-09-13,c3f2ef20181b73f6,220574a7a6a71afa,2.99,1,8/29/09,PMOF,iPhone,5b0619a92b6465e7,consumable
4,2016-09-04,326676f4b2e6188d,220574a7a6a71afa,27.99,1,8/29/09,PMOF,iPhone,8a17af073d2b213a,consumable

In [40]:
# Create a new column 'content_type', if it is a in-app purchase, then give it a value 'inapp'
# Otherwise, give it a value 'app'
df.loc[pd.notna(df['parent_app_content_id']),'content_type'] = 'inapp'

In [41]:
# The parent_app_content_id will always be the content_id in the app_dat.csv table
# The only difference is if the transaction is a in-app purchase, the 'content_type' column is 'inapp'
# If it is an app purchase, the 'content_type' column is 'app'
df.loc[pd.isna(df['parent_app_content_id']),'parent_app_content_id'] = df.loc[pd.isna(df['parent_app_content_id']),'content_id']

In [42]:
df.loc[pd.isna(df['content_type']),'content_type'] = 'app'

In [43]:
df.head()

,transaction_dt,content_id,acct_id,price,device_id,create_dt,payment_type,device_name,parent_app_content_id,type,content_type
0,2016-08-28,b6cf4f33e7455df4,220574a7a6a71afa,11.99,1,8/29/09,PMOF,iPhone,61cea77b9bc843d1,subscription,inapp
1,2016-07-19,4431e62862d98419,220574a7a6a71afa,23.99,1,8/29/09,PMOF,iPhone,62bbc9735ee184a4,consumable,inapp
2,2016-08-08,14f26ecc7ab37e68,220574a7a6a71afa,0.99,1,8/29/09,PMOF,iPhone,5070e02253fe2a85,consumable,inapp
3,2016-09-13,c3f2ef20181b73f6,220574a7a6a71afa,2.99,1,8/29/09,PMOF,iPhone,5b0619a92b6465e7,consumable,inapp
4,2016-09-04,326676f4b2e6188d,220574a7a6a71afa,27.99,1,8/29/09,PMOF,iPhone,8a17af073d2b213a,consumable,inapp

In [44]:
pd.isna(df['content_type']).sum()

0

In [48]:
df_app.head()

               app_name parent_app_content_id category_id  device_id_app
0  half-slouched having      22dfac9721b899cb         Y-8              3
1      lift whale-ships      7c645810cd7f166e         M-7              3
2    mightily community      c495bcb878faffaa         Y-8              2
3   session: too--shall      4e683dcd461cdd22         Y-8              1
4          That Zoology      6473dd29a2badbf1         Y-8              3

In [49]:
# Change the column names of df_app to avoid name duplication with other tables 
df_app = df_app.rename(columns = {'app_name':'app_name', 
                                  'content_id':'parent_app_content_id', 
                                  'category_id':'category_id', 
                                  'device_id':'device_id_app'})

In [50]:
df_app.head()

               app_name parent_app_content_id category_id  device_id_app
0  half-slouched having      22dfac9721b899cb         Y-8              3
1      lift whale-ships      7c645810cd7f166e         M-7              3
2    mightily community      c495bcb878faffaa         Y-8              2
3   session: too--shall      4e683dcd461cdd22         Y-8              1
4          That Zoology      6473dd29a2badbf1         Y-8              3

In [51]:
# join with df_app
df = pd.merge(df, df_app, on='parent_app_content_id', how='inner')

In [52]:
pd.isna(df['app_name']).sum()

0

In [53]:
# join with df_category
df = pd.merge(df, df_category, on='category_id', how='inner')

In [54]:
df.head()

,transaction_dt,content_id,acct_id,price,device_id,create_dt,payment_type,device_name,parent_app_content_id,type,content_type,app_name,category_id,device_id_app,category_name
0,2016-08-28,b6cf4f33e7455df4,220574a7a6a71afa,11.99,1,8/29/09,PMOF,iPhone,61cea77b9bc843d1,subscription,inapp,events Bildad's,M-7,3,Utilities
1,2016-07-11,b6cf4f33e7455df4,363b84800742ffb5,11.99,1,11/5/09,PMOF,iPhone,61cea77b9bc843d1,subscription,inapp,events Bildad's,M-7,3,Utilities
2,2016-07-20,b6cf4f33e7455df4,6eec3f28d16e345b,11.99,1,8/11/08,PMOF,iPhone,61cea77b9bc843d1,subscription,inapp,events Bildad's,M-7,3,Utilities
3,2016-08-12,b6cf4f33e7455df4,4690bdd57b0e57ea,11.99,1,10/29/07,PMOF,iPhone,61cea77b9bc843d1,subscription,inapp,events Bildad's,M-7,3,Utilities
4,2016-06-03,b6cf4f33e7455df4,1431fe11b67a4fce,11.99,1,11/22/12,PMOF,iPhone,61cea77b9bc843d1,subscription,inapp,events Bildad's,M-7,3,Utilities

In [55]:
pd.isna(df['category_name']).sum()

0

In [56]:
# Export merged tables to a csv file for visualization
df.to_csv('data_cleaned.csv')

### Analysis

In [57]:
# calculate revenue by category

In [58]:
df_by_category = df.groupby('category_name')['price'].sum().reset_index()

In [59]:
df_by_category

       category_name         price
0      Entertainment  1.396637e+06
1              Games  1.225983e+07
2    Photos & Videos  3.419505e+06
3  Social Networking  6.255737e+05
4          Utilities  1.335764e+06

In [60]:
# calculate % of revenue from games category 
df_by_category.loc[df_by_category['category_name'] == 'Games', 'price'] /  df_by_category['price'].sum()

1    0.64399
Name: price, dtype: float64

In [61]:
# min transaction date
df['transaction_dt'].min()

'2016-06-01'

In [62]:
# max transaction date 
df['transaction_dt'].max()

'2016-09-21'

In [63]:
# change column transaction_dt to datetime
# create a new column transaction_weekday for day of week 
df['transaction_dt'] = pd.to_datetime(df['transaction_dt'])
df['transaction_weekday'] = df['transaction_dt'].dt.day_name()

In [64]:
df.head()

,transaction_dt,content_id,acct_id,price,device_id,create_dt,payment_type,device_name,parent_app_content_id,type,content_type,app_name,category_id,device_id_app,category_name,transaction_weekday
0,2016-08-28,b6cf4f33e7455df4,220574a7a6a71afa,11.99,1,8/29/09,PMOF,iPhone,61cea77b9bc843d1,subscription,inapp,events Bildad's,M-7,3,Utilities,Sunday
1,2016-07-11,b6cf4f33e7455df4,363b84800742ffb5,11.99,1,11/5/09,PMOF,iPhone,61cea77b9bc843d1,subscription,inapp,events Bildad's,M-7,3,Utilities,Monday
2,2016-07-20,b6cf4f33e7455df4,6eec3f28d16e345b,11.99,1,8/11/08,PMOF,iPhone,61cea77b9bc843d1,subscription,inapp,events Bildad's,M-7,3,Utilities,Wednesday
3,2016-08-12,b6cf4f33e7455df4,4690bdd57b0e57ea,11.99,1,10/29/07,PMOF,iPhone,61cea77b9bc843d1,subscription,inapp,events Bildad's,M-7,3,Utilities,Friday
4,2016-06-03,b6cf4f33e7455df4,1431fe11b67a4fce,11.99,1,11/22/12,PMOF,iPhone,61cea77b9bc843d1,subscription,inapp,events Bildad's,M-7,3,Utilities,Friday

In [65]:
# calculate revenue by date 
revenue_by_date = df.groupby('transaction_dt')['price'].sum().reset_index()

In [66]:
revenue_by_date

    transaction_dt      price
0       2016-06-01  169054.90
1       2016-06-02  167704.90
2       2016-06-03  169001.35
3       2016-06-04  179747.83
4       2016-06-05  182006.15
..             ...        ...
105     2016-09-17  181764.70
106     2016-09-18  182206.94
107     2016-09-19  170011.85
108     2016-09-20  167154.59
109     2016-09-21  169329.67

[110 rows x 2 columns]

In [67]:
revenue_by_date['transaction_weekday'] = revenue_by_date['transaction_dt'].dt.day_name()

In [68]:
revenue_by_date

    transaction_dt      price transaction_weekday
0       2016-06-01  169054.90           Wednesday
1       2016-06-02  167704.90            Thursday
2       2016-06-03  169001.35              Friday
3       2016-06-04  179747.83            Saturday
4       2016-06-05  182006.15              Sunday
..             ...        ...                 ...
105     2016-09-17  181764.70            Saturday
106     2016-09-18  182206.94              Sunday
107     2016-09-19  170011.85              Monday
108     2016-09-20  167154.59             Tuesday
109     2016-09-21  169329.67           Wednesday

[110 rows x 3 columns]

In [69]:
# Export revenue_by_date table to a csv file for visualization
revenue_by_date.to_csv('revenue_by_date.csv')

In [71]:
# calculate weekend daily revenue
daily_revenue_weekend = revenue_by_date.loc[revenue_by_date['transaction_weekday'].isin(['Saturday','Sunday']), 'price'].mean()

In [72]:
# calculate weekday daily revenue
daily_revenue_weekday = revenue_by_date.loc[~revenue_by_date['transaction_weekday'].isin(['Saturday','Sunday']), 'price'].mean()

In [73]:
daily_revenue_weekend

181393.56812495377

In [74]:
daily_revenue_weekday

169650.1675640764

In [75]:
# calculate relative difference between daily weekly and weekend revenue
(daily_revenue_weekend - daily_revenue_weekday) / daily_revenue_weekday

0.06922127298484348

In [76]:
# Check the daily revenue outlier identified on Tableau chart- 2016-07-04 
revenue_by_date_all = df.groupby('transaction_dt')['price'].agg(['sum','count']).reset_index()

In [77]:
revenue_by_date_all['revenue_per_transaction'] = revenue_by_date_all['sum'] / revenue_by_date_all['count']

In [78]:
revenue_by_date_all.sort_values(by='revenue_per_transaction',ascending=False)
# 2016-07-04 (independence day) has high total revenue, # transactions, and revenue per transaction

    transaction_dt        sum  count  revenue_per_transaction
33      2016-07-04  216196.76  36888                 5.860897
17      2016-06-18  180624.31  32269                 5.597456
4       2016-06-05  182006.15  32681                 5.569173
25      2016-06-26  181809.44  32653                 5.567925
24      2016-06-25  181276.39  32582                 5.563697
..             ...        ...    ...                      ...
107     2016-09-19  170011.85  33836                 5.024585
108     2016-09-20  167154.59  33330                 5.015139
103     2016-09-15  167061.33  33470                 4.991375
100     2016-09-12  166165.72  33294                 4.990861
97      2016-09-09  167464.01  33613                 4.982120

[110 rows x 4 columns]

In [79]:
# Calculate average daily revenue for all days expect for 2016-07-04
revenue_by_date_all.loc[revenue_by_date_all['transaction_dt'] != '2016-07-04', 'sum'].mean()

172670.73844033552

In [80]:
# Calculate daily revenue for 2016-07-04
revenue_by_date_all.loc[revenue_by_date_all['transaction_dt'] == '2016-07-04', 'sum'].mean()

216196.75999990554

In [81]:
# revenue and number of transactions by date and user
revenue_by_date_user = df.groupby(['transaction_dt','acct_id'])['price'].agg(['sum','count']).reset_index()

In [82]:
revenue_by_date_user.sort_values(by='sum',ascending=False)

        transaction_dt           acct_id     sum  count
1992515     2016-09-18  011adcdd87696e67  287.77     23
1088788     2016-07-29  86c5c46b078d2fe9  281.74     26
419068      2016-06-23  ac14aed16eae1b41  279.75     25
1004385     2016-07-25  0203502006a86ab1  278.79     21
806846      2016-07-14  7904e78045a1f58d  257.82     18
...                ...               ...     ...    ...
1270277     2016-08-08  1b1abeab0cd8aec1    0.00      1
1270278     2016-08-08  1b1b4a40643e679e    0.00      1
1270279     2016-08-08  1b1df2526e61293b    0.00      1
1270281     2016-08-08  1b21036fcae4377f    0.00      1
1034489     2016-07-26  9d1ed5a806e32fc9    0.00      2

[2068978 rows x 4 columns]

In [83]:
# revenue and number of transactions by date and content_id
revenue_by_date_content = df.groupby(['transaction_dt','content_id'])['price'].agg(['sum','count']).reset_index()

In [84]:
revenue_by_date_content.sort_values(by='sum',ascending=False)

       transaction_dt        content_id      sum  count
121848     2016-07-12  e4f948344caf86b7  1391.52     48
227773     2016-08-18  5127c2d615a704f3  1319.56     44
214935     2016-08-13  e4f948344caf86b7  1304.55     45
242325     2016-08-26  5127c2d615a704f3  1229.59     41
285610     2016-09-10  330640111f15f83e  1203.57     43
...               ...               ...      ...    ...
197514     2016-08-07  e81506bee4ed252e     0.00     45
52115      2016-06-18  ec2737eea22b1fc6     0.00     43
281334     2016-09-08  b5802f5ce77ebba0     0.00     46
197509     2016-08-07  e7d57aaaa0629317     0.00     43
269474     2016-09-04  a2f5435e63872446     0.00     47

[319982 rows x 4 columns]

In [85]:
# revenue and number of transactions by date and app_name
revenue_by_date_app = df.groupby(['transaction_dt','app_name'])['price'].agg(['sum','count']).reset_index()

In [86]:
revenue_by_date_app.sort_values(by='sum',ascending=False)

       transaction_dt              app_name      sum  count
81998      2016-08-25           aright Davy  5447.25    375
38138      2016-07-09           aright Davy  5438.20    380
52093      2016-07-23           aright Davy  5366.05    395
53090      2016-07-24           aright Davy  5302.04    396
18201      2016-06-19           aright Davy  5301.19    381
...               ...                   ...      ...    ...
59697      2016-07-30   symbolize gentleman     0.00     41
59698      2016-07-30      sympathetic saw;     0.00     40
59699      2016-07-30  systematized settees     0.00     50
59706      2016-07-30      teaches anything     0.00     50
109650     2016-09-21           zone arched     0.00     48

[109651 rows x 4 columns]

In [87]:
# Calculate the revenue and # transactions by date and category 
revenue_by_date_category = df.groupby(['transaction_dt','category_name'])['price'].agg(['sum','count']).reset_index()

In [88]:
revenue_by_date_category.to_csv('revenue_by_date_category.csv')

In [89]:
# game category top apps with most revenue 
game_by_app = df.loc[df['category_name']=='Games',:].groupby('app_name')['price'].sum().reset_index()

In [90]:
game_by_app.sort_values(by='price',ascending=False)

                  app_name      price
98             aright Davy  525327.37
368       unwritten hungry  505698.02
130           ceases half;  345078.78
8          AS-IS vagueness  323134.93
1             'vomited men  322644.08
..                     ...        ...
125        canoe midships!       0.00
278  predictions key-hole;       0.00
275        powerfully plan       0.00
269     painted ourselves;       0.00
390            zone arched       0.00

[391 rows x 2 columns]

In [91]:
game_by_app.to_csv('game_by_app.csv')

In [92]:
# Get the revenue by category and inapp/app purchases
df_category_inapp_agg = df.groupby(['category_name','content_type'])['price'].sum().reset_index()

In [93]:
df_category_inapp_agg.to_csv("df_category_inapp_agg.csv")

In [94]:
# check number of free only and PMOF users
df_account.groupby('payment_type')['acct_id'].count()

payment_type
Free only    50000
PMOF         50000
Name: acct_id, dtype: int64

In [96]:
# revenue from free only and PMOF users
df.groupby('payment_type')['price'].sum()

payment_type
Free only    0.000000e+00
PMOF         1.903731e+07
Name: price, dtype: float64

In [97]:
# for app purchases (Download), calculate revenue for free only and PMOF users 
df[df['content_type'] == 'app'].groupby('payment_type')['price'].count()

payment_type
Free only    1167271
PMOF          425655
Name: price, dtype: int64

In [98]:
min(df_account['create_dt'])

'1/1/08'

In [99]:
max(df_account['create_dt'])

'9/9/16'

In [100]:
min(df['transaction_dt'])

Timestamp('2016-06-01 00:00:00')

In [101]:
max(df['transaction_dt'])

Timestamp('2016-09-21 00:00:00')

In [105]:
df['create_dt'] = pd.to_datetime(df['create_dt'])

In [106]:
# calculate the account age of = max(transaction date) - account creation date 
df['age'] = (df['transaction_dt'].max() - df['create_dt']).dt.days

In [108]:
df_account['create_dt'] = pd.to_datetime(df_account['create_dt'])

In [109]:
df_account['age'] = (df['transaction_dt'].max() - df_account['create_dt']).dt.days

In [110]:
# get a cohort users created between 2016-06-01 and 2016-08-31
df_account_subset = df_account[(df_account['create_dt']>=pd.to_datetime('2016-06-01')) & (df_account['create_dt']<=pd.to_datetime('2016-08-31'))]

In [111]:
# Get first app purchase date 
df_first_app_purchase = df[df['content_type']=='app'].groupby('acct_id')['transaction_dt'].min().reset_index()

In [112]:
df_first_tran_join = pd.merge(df_account_subset, df_first_app_purchase, on='acct_id',how='left')

In [113]:
# get the days from account creation to first transaction
df_first_tran_join['days_to_first_transaction'] = (df_first_tran_join['transaction_dt'] - df_first_tran_join['create_dt']).dt.days

In [114]:
df_first_tran_join.head()

,acct_id,create_dt,payment_type,age,transaction_dt,days_to_first_transaction
0,d997ebd8b876890c,2016-07-17,Free only,66,NaT,NaN
1,3ad1db4157dccea8,2016-06-09,Free only,104,2016-06-01,-8.0
2,1a17b8ada006aed8,2016-06-10,Free only,103,NaT,NaN
3,f7378848007b8912,2016-08-19,Free only,33,NaT,NaN
4,fb03994d5f558600,2016-06-09,Free only,104,2016-06-01,-8.0

In [115]:
df_first_tran_join[df_first_tran_join['days_to_first_transaction']<=0].count()

acct_id                      818
create_dt                    818
payment_type                 818
age                          818
transaction_dt               818
days_to_first_transaction    818
dtype: int64

In [116]:
df_first_tran_join[df_first_tran_join['days_to_first_transaction']>0].count()
# Because of data quality issue, date to first transaction date is not available

acct_id                      10
create_dt                    10
payment_type                 10
age                          10
transaction_dt               10
days_to_first_transaction    10
dtype: int64

In [117]:
# Get a cohort of users before 2016-06-01
df_account_before_june = df_account[df_account['create_dt']<=pd.to_datetime('2016-05-31')]

In [118]:
df_account_before_june.groupby('payment_type').count()

              acct_id  create_dt    age
payment_type
Free only       38315      38315  38315
PMOF            50000      50000  50000

In [119]:
# Calculate revenue per user
revenue_by_user = df.groupby('acct_id')['price'].sum().reset_index()

In [121]:
# Get the revenue for users with payment on file 
df_account_before_june_paid = df_account_before_june[df_account_before_june['payment_type'] == 'PMOF']

In [122]:
df_account_before_june_paid = pd.merge(df_account_before_june_paid, revenue_by_user, on='acct_id', how='left')

In [123]:
df_account_before_june_paid['price'] =  df_account_before_june_paid['price'].fillna(0)

In [124]:
df_account_before_june_paid.to_csv("paid_by_age.csv")

In [125]:
# Get the number of download (app purchases) for users without payment on file 
df_account_before_june_unpaid = df_account_before_june[df_account_before_june['payment_type'] == 'Free only']

In [126]:
app_purchase_by_user = df[df['content_type']=='app'].groupby('acct_id')['price'].count().reset_index()

In [127]:
app_purchase_by_user.columns= ['acct_id','app_purchase_count']

In [128]:
df_account_before_june_unpaid = pd.merge(df_account_before_june_unpaid,app_purchase_by_user,on='acct_id')

In [129]:
df_account_before_june_unpaid['app_purchase_count'] = df_account_before_june_unpaid['app_purchase_count'].fillna(0)

In [130]:
df_account_before_june_unpaid.to_csv('df_account_before_june_unpaid.csv')

In [131]:
# Get the number of download (app purchases) for users with payment on file 
df_account_before_june_paid = pd.merge(df_account_before_june_paid, app_purchase_by_user, on ='acct_id')

In [132]:
df_account_before_june_paid.to_csv('app_purchase_paid_user.csv')